In [29]:
import pandas as pd

In [30]:
temp_data = pd.DataFrame({
    'Date': ['12-02-2023', '13-02-2023', '14-02-2023', '15-02-2023', '16-02-2023', '20-02-2023'],
    'TempMax': [24.3, 26.9, 23.4, 15.5, 16.1, 15]
}, index=range(17, 23))

rainfall_data = pd.DataFrame({
    'Date': ['12-02-2023', '13-02-2023', '14-02-2023', '15-02-2023', '16-02-2023', '25-02-2023'],
    'Rainfall': [0, 3.6, 3.6, 39.8, 2.8, 5]
}, index=range(85, 91))

temp_data
rainfall_data

          Date  TempMax
17  12-02-2023     24.3
18  13-02-2023     26.9
19  14-02-2023     23.4
20  15-02-2023     15.5
21  16-02-2023     16.1
22  20-02-2023     15.0

          Date  Rainfall
85  12-02-2023       0.0
86  13-02-2023       3.6
87  14-02-2023       3.6
88  15-02-2023      39.8
89  16-02-2023       2.8
90  25-02-2023       5.0

In [43]:
pd.concat([temp_data, rainfall_data])  # axis=0 by default, vertically concatenated

          Date  TempMax  Rainfall
17  12-02-2023     24.3       NaN
18  13-02-2023     26.9       NaN
19  14-02-2023     23.4       NaN
20  15-02-2023     15.5       NaN
21  16-02-2023     16.1       NaN
22  20-02-2023     15.0       NaN
85  12-02-2023      NaN       0.0
86  13-02-2023      NaN       3.6
87  14-02-2023      NaN       3.6
88  15-02-2023      NaN      39.8
89  16-02-2023      NaN       2.8
90  25-02-2023      NaN       5.0

In [36]:
pd.concat([temp_data, rainfall_data], ignore_index=True)

          Date  TempMax  Rainfall
0   12-02-2023     24.3       NaN
1   13-02-2023     26.9       NaN
2   14-02-2023     23.4       NaN
3   15-02-2023     15.5       NaN
4   16-02-2023     16.1       NaN
5   20-02-2023     15.0       NaN
6   12-02-2023      NaN       0.0
7   13-02-2023      NaN       3.6
8   14-02-2023      NaN       3.6
9   15-02-2023      NaN      39.8
10  16-02-2023      NaN       2.8
11  25-02-2023      NaN       5.0

In [37]:
pd.concat([temp_data, rainfall_data], axis=1)  # horizontally concatenated

          Date  TempMax        Date  Rainfall
17  12-02-2023     24.3         NaN       NaN
18  13-02-2023     26.9         NaN       NaN
19  14-02-2023     23.4         NaN       NaN
20  15-02-2023     15.5         NaN       NaN
21  16-02-2023     16.1         NaN       NaN
22  20-02-2023     15.0         NaN       NaN
85         NaN      NaN  12-02-2023       0.0
86         NaN      NaN  13-02-2023       3.6
87         NaN      NaN  14-02-2023       3.6
88         NaN      NaN  15-02-2023      39.8
89         NaN      NaN  16-02-2023       2.8
90         NaN      NaN  25-02-2023       5.0

# Join

In [41]:
pd.concat([temp_data, rainfall_data], axis=0, join='inner')

          Date
17  12-02-2023
18  13-02-2023
19  14-02-2023
20  15-02-2023
21  16-02-2023
22  20-02-2023
85  12-02-2023
86  13-02-2023
87  14-02-2023
88  15-02-2023
89  16-02-2023
90  25-02-2023

In [42]:
pd.concat([temp_data, rainfall_data], axis=0, join='outer')

          Date  TempMax  Rainfall
17  12-02-2023     24.3       NaN
18  13-02-2023     26.9       NaN
19  14-02-2023     23.4       NaN
20  15-02-2023     15.5       NaN
21  16-02-2023     16.1       NaN
22  20-02-2023     15.0       NaN
85  12-02-2023      NaN       0.0
86  13-02-2023      NaN       3.6
87  14-02-2023      NaN       3.6
88  15-02-2023      NaN      39.8
89  16-02-2023      NaN       2.8
90  25-02-2023      NaN       5.0

# Keys

In [86]:
df_keyed = pd.concat([temp_data, rainfall_data], axis=0, keys=('Delhi', 'Chennai'))
df_keyed

                  Date  TempMax  Rainfall
Delhi   17  12-02-2023     24.3       NaN
        18  13-02-2023     26.9       NaN
        19  14-02-2023     23.4       NaN
        20  15-02-2023     15.5       NaN
        21  16-02-2023     16.1       NaN
        22  20-02-2023     15.0       NaN
Chennai 85  12-02-2023      NaN       0.0
        86  13-02-2023      NaN       3.6
        87  14-02-2023      NaN       3.6
        88  15-02-2023      NaN      39.8
        89  16-02-2023      NaN       2.8
        90  25-02-2023      NaN       5.0

In [87]:
df_keyed.index

MultiIndex([(  'Delhi', 17),
            (  'Delhi', 18),
            (  'Delhi', 19),
            (  'Delhi', 20),
            (  'Delhi', 21),
            (  'Delhi', 22),
            ('Chennai', 85),
            ('Chennai', 86),
            ('Chennai', 87),
            ('Chennai', 88),
            ('Chennai', 89),
            ('Chennai', 90)],
           )

In [88]:
df_keyed.loc[('Delhi', 17)]

Date        12-02-2023
TempMax           24.3
Rainfall           NaN
Name: (Delhi, 17), dtype: object

In [89]:
df_keyed.loc[[('Delhi', 17), ('Chennai', 85)]]

                  Date  TempMax  Rainfall
Delhi   17  12-02-2023     24.3       NaN
Chennai 85  12-02-2023      NaN       0.0

In [90]:
df_keyed = pd.concat([temp_data, rainfall_data], axis=1, keys=('Delhi', 'Chennai'))
df_keyed

         Delhi             Chennai
          Date TempMax        Date Rainfall
17  12-02-2023    24.3         NaN      NaN
18  13-02-2023    26.9         NaN      NaN
19  14-02-2023    23.4         NaN      NaN
20  15-02-2023    15.5         NaN      NaN
21  16-02-2023    16.1         NaN      NaN
22  20-02-2023    15.0         NaN      NaN
85         NaN     NaN  12-02-2023      0.0
86         NaN     NaN  13-02-2023      3.6
87         NaN     NaN  14-02-2023      3.6
88         NaN     NaN  15-02-2023     39.8
89         NaN     NaN  16-02-2023      2.8
90         NaN     NaN  25-02-2023      5.0

In [91]:
df_keyed['Delhi']

          Date  TempMax
17  12-02-2023     24.3
18  13-02-2023     26.9
19  14-02-2023     23.4
20  15-02-2023     15.5
21  16-02-2023     16.1
22  20-02-2023     15.0
85         NaN      NaN
86         NaN      NaN
87         NaN      NaN
88         NaN      NaN
89         NaN      NaN
90         NaN      NaN

In [93]:
type(df_keyed)
type(df_keyed['Delhi'])

pandas.core.frame.DataFrame

pandas.core.frame.DataFrame

In [94]:
df_keyed.columns

MultiIndex([(  'Delhi',     'Date'),
            (  'Delhi',  'TempMax'),
            ('Chennai',     'Date'),
            ('Chennai', 'Rainfall')],
           )

In [97]:
df_keyed[('Delhi', 'Date')]

17    12-02-2023
18    13-02-2023
19    14-02-2023
20    15-02-2023
21    16-02-2023
22    20-02-2023
85           NaN
86           NaN
87           NaN
88           NaN
89           NaN
90           NaN
Name: (Delhi, Date), dtype: object

In [98]:
df_keyed[[('Delhi', 'Date'), ('Chennai', 'Rainfall')]]

         Delhi  Chennai
          Date Rainfall
17  12-02-2023      NaN
18  13-02-2023      NaN
19  14-02-2023      NaN
20  15-02-2023      NaN
21  16-02-2023      NaN
22  20-02-2023      NaN
85         NaN      0.0
86         NaN      3.6
87         NaN      3.6
88         NaN     39.8
89         NaN      2.8
90         NaN      5.0